Revit 2027 API
FamilyInstance.SetCopingIds Method
Specifies the set of coping cutters on this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetCopingIds(
	ICollection<ElementId> cutters
)
Public Function SetCopingIds (
	cutters As ICollection(Of ElementId)
) As Boolean
public:
bool SetCopingIds(
	ICollection<ElementId^>^ cutters
)
member SetCopingIds :
        cutters : ICollection<ElementId> -> bool
Parameters
cutters ICollection<ElementId>
A set of coping cutters (steel beams and steel columns).
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException | Thrown when 'cutters' contains this instance.
InvalidOperationException | Thrown when regeneration fails or if a cutter element is not a FamilyInstance.
Remarks
 The set may be null or empty, but may not contain the element being coped.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace